Revit 2027 API
FamilyInstance.HostParameter Property
If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve, as long as the family of the instance isn't work plane based.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HostParameter { get; }
Public ReadOnly Property HostParameter As Double
	Get
public:
property double HostParameter {
	double get ();
}
member HostParameter : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Only hosted instances whose family is not work plane based can support this functionality.
InvalidOperationException |  Only hosted instances of type Wall or in-place elements of category OST_Walls can support this functionality.
Remarks
This works for instances with a host element that is of type Wall or is in the OST_Walls category only, including in-place ones.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace